Repository: common-repository/wc-begateway-payment
Catalog: languages/wc-begateway-payment-*.po
Languages: be_by

source: BeGateway Payment Gateway for WooCommerce
be_by: WooCommerce BeGateway Payment Gateway

source: Extends WooCommerce with BeGateway payment gateway.
be_by: Пашырае WooCommerce плацёжным шлюзам BeGateway.

source: Error to process subscription payment with the error: %s
be_by: Памылка апрацоўкі аплаты падпіскі: %s

source: Card token not found
be_by: Токен карты не знойдзены

source: Error to process subscription payment
be_by: Памылка апрацоўкі аплаты падпіскі

source: Successfully processed subscription payment
be_by: Аплата падпіскі апрацавана

source: Transaction UID:
be_by: Нумар аперацыі:

source: Via %s card ending in %s (%s)
be_by: Праз карту %s, якая заканчваецца на %s (%s)

source: BeGateway payment gateway solution
be_by: Рашэнне шлюза аплаты BeGateway

source: Error to get a payment token
be_by: Памылка ў атрыманні токена аплаты

source: Make payment
be_by: Аплаціць

source: Cancel order
be_by: Адмяніць замову

source: Invalid payment method
be_by: Несапраўдны спосаб аплаты

source: No transaction reference UID to capture
be_by: Няма даведачнага ідэнтыфікатара аперацыі для спісання

source: Transaction is already captured
be_by: Аплата ўжо спісана

source: Capture completed
be_by: Спісанне паспяхова

source: Error to capture transaction
be_by: Памылка спісання транзакцыі

source: Error:
be_by: Памылка:

source: No transaction reference UID to cancel
be_by: Няма даведачнага ідэнтыфікатара аперацыі для адмены

source: Void complete
be_by: Адмена паспяхова

source: Error to void transaction
be_by: Памылка анулявання аперацыі

source: No transaction reference UID to refund
be_by: Няма даведачнага ідэнтыфікатара аперацыі для вяртання сродкаў

source: Refunded from Woocommerce
be_by: Вернута з WooCommerce

source: Refund completed
be_by: Вяртанне завершана

source: Error to refund transaction
be_by: Памылка вяртання сродкаў па аперацыі

source: There was a problem creating the transaction!
be_by: Узнікла праблема са стварэннем транзакцыі!

source: Enable/Disable
be_by: Уключыць/Выключыць

source: Enable BeGateway
be_by: Уключыць BeGateway

source: Title
be_by: Загаловак

source: This is the title displayed to the user during checkout
be_by: Гэты загаловак паказваецца пакупніку падчас афармлення замовы

source: Credit or debit card
be_by: Банкаўская карта

source: Description
be_by: Апісанне

source: This is the description which the user sees during checkout
be_by: Гэта апісанне, якое карыстальнік бачыць падчас афармлення замовы

source: Visa, Mastercard
be_by: Visa, Masterсard

source: Shop ID
be_by: ID крамы

source: Please enter your shop Id
be_by: Пазначце ID крамы

source: Secret key
be_by: Сакрэтны ключ

source: Please enter your shop secret key
be_by: Пазначце сакрэтны ключ вашай крамы

source: Public key
be_by: Публічны ключ

source: Please enter your shop public key
be_by: Пазначце публічны ключ вашай крамы

source: Payment gateway domain
be_by: Дамен плацёжнага шлюза

source: Please enter payment gateway domain of your payment processor
be_by: Пазначце дамен плацёжнага шлюза вашага плацёжнага працэсара

source: Payment page domain
be_by: Дамен старонкі аплаты

source: Please enter payment page domain of your payment processor
be_by: Пазначце дамен старонкі аплаты вашага плацёжнага працэсара

source: Transaction type
be_by: Тып транзакцыі

source: Payment
be_by: Аплата

source: Authorization
be_by: Аўтарызацыя

source: Select Payment (Authorization & Capture) or Authorization
be_by: Абярыце «Аплата» («Аўтарызацыя» + «Спісанне») або «Аўтарызацыя»

source: Payment methods
be_by: Спосабы аплаты

source: Select the payment method types to accept them explicity
be_by: Выберыце спосабы аплаты, каб прыняць толькі іх

source: Bankcard
be_by: Банкаўская карта

source: Halva
be_by: Халва

source: ERIP
be_by: АРІП

source: ERIP service code
be_by: Код паслугі АРІП

source: Enter ERIP service code provided you by your payment service provider
be_by: Пазначце код паслугі АРІП, дадзены вам плацёжным правайдэрам

source: Payment valid (minutes)
be_by: Рахунак сапраўдны (хвілін)

source: The value sets a period of time within which an order must be paid
be_by: Гэта значэнне вызначае перыяд часу, цягам якога замова мусіць быць аплачана

source: Payment mode
be_by: Рэжым аплаты

source: Test
be_by: Тэставы

source: Live
be_by: Сапраўдны

source: Select module payment mode
be_by: Выберыце рэжым аплаты для модуля

source: Debug Log
be_by: Журнал адладкі

source: Enable logging
be_by: Уключыць запіс у журнал

source: Log events
be_by: Запісваць падзеі

source: Order is cancelled
be_by: Заказ адменены

source: Remaining balance
be_by: Баланс

source: Total authorized
be_by: Усяго

source: Total captured
be_by: Усяго спісана

source: Total refunded
be_by: Усяго вернута

source: You are about to CAPTURE this payment
be_by: Вы збіраецеся спісаць гэтую суму

source: Capture full amount (%s)
be_by: Спісаць поўную суму (%s)

source: You are about to CANCEL this payment
be_by: Вы збіраецеся адмяніць гэты плацеж

source: Cancel transaction
be_by: Адмена аперацыі

source: Partly capture
be_by: Спісанне сродкаў

source: Capture amount
be_by: Сума спісання

source: Capture specified amount
be_by: Спісаць сродкі

source: Partly refund
be_by: Зварот сродкаў

source: Refund amount
be_by: Сума звароту

source: Refund specified amount
be_by: Вярнуць сродкі

source: Payment method
be_by: Метад аплаты

source: Transaction UID
be_by: Нумар аперацыі

source: Card number
be_by: Нумар карты

source: Card brand
be_by: Тып карткі

source: Settings
be_by: Налады

source: Support
be_by: Падтрымка

source: Docs
be_by: Дакументацыя

source: Transactions
be_by: Аперацыі

source: Please wait...
be_by: Калі ласка, пачакайце…

source: Capture success
be_by: Спісанне сродкаў паспяхова

source: Order already cancelled
be_by: Заказ ужо адменены

source: Cancel success
be_by: Адмена аперацыі паспяхова

source: Refund success
be_by: Вяртанне сродкаў паспяхова

source: Capture partly success
be_by: Спісанне паспяхова
